1000	กสท
1A00000	สายงานตรวจสอบ
1A00100	ฝ่ายตรวจสอบภายใน
1B00000	กรรมการผู้จัดการใหญ่
1B00100	ศูนย์ความปลอดภัย อาชีวอนามัย และสภาพฯ
1B00200	ศูนย์ป้องกันและปราบปรามการทุจริต(ศปท.)
1C00000	สายงานกฎหมายและบริหารงานกลาง
1C00100	ฝ่ายเลขานุการผู้บริหาร 1
1C00200	ฝ่ายกรรมการผู้จัดการใหญ่
1C00400	ศูนย์ธุรการรวม
1C10000	กลุ่มอำนวยการ
1C10100	ฝ่ายพัสดุ 1
1C10200	ฝ่ายโยธาและขนส่ง
1C10300	ฝ่ายพัฒนาสินทรัพย์ 1
1D00000	สายงานธุรกิจดิจิทัล
1D10000	กลุ่ม NBN Co.
1D10100	ฝ่ายวิศวกรรมโครงข่าย
1D10200	ฝ่ายสื่อสัญญาณ 1
1D10300	ฝ่ายบริหารและปฏิบัติการภูมิภาค
1D10400	ฝ่ายโครงข่ายระหว่างประเทศ
1D10500	ฝ่ายโครงข่ายภายในประเทศ
1D10600	ฝ่ายธุรกิจคลาวด์และบิ๊กดาต้า
1D20000	สายงาน(ข)- กลุ่มปฏิบัติการโครงข่าย
1D20100	ฝ่ายโครงข่ายระหว่างประเทศ
1D20200	ฝ่ายโครงข่ายภายในประเทศ
1D30000	กลุ่มดิจิทัล
1D30100	ฝ่ายธุรกิจระหว่างประเทศ
1D30200	ฝ่ายธุรกิจบริการดิจิทัล
1D30300	ฝ่ายธุรกิจแลกเปลี่ยนข้อมูล
1E00000	สายงานธุรกิจโทรศัพท์
1E00100	ฝ่ายธุรกิจโทรศัพท์ในประเทศ
1E00200	ฝ่ายชุมสายโทรศัพท์
1E10000	สายงานธุรกิจโทรศัพท์ กลุ่มธุรกิจโทรศัพท์
1E10100	ฝ่ายธุรกิจโทรศัพท์ระหว่างประเทศ
1E10200	ฝ่ายพัฒนาธุรกิจต่างประเทศ
1F00000	สายงานกลยุทธ์
1F00100	ฝ่ายวางแผนกลยุทธ์และพัฒนาองค์กร 1
1F00200	ฝ่ายบริหารความเสี่ยงและควบคุมภายใน
1F00300	ฝ่ายบริหารคุณภาพ
1F00400	ฝ่ายวิจัยและพัฒนา
1F10000	กลุ่มกลยุทธ์องค์กร 1
1F10100	ฝ่ายวิจัยและพัฒนา
1F10200	ฝ่ายบริหารความเสี่ยงและควบคุมภายใน 1
1F10300	ฝ่ายพัฒนาและประเมินผลองค์กร
1G00000	สายงานขายลูกค้าองค์กร
1G00001	สายงานธุรกิจบรอดแบนด์
1G10000	สายงาน(อ)- กลุ่มธุรกิจสื่อสารข้อมูล
1G10100	ฝ่ายพัฒนาธุรกิจวงจรสื่อสารข้อมูล
1G10200	ฝ่ายพัฒนาธุรกิจ Internet
1G10300	ฝ่ายวิศวกรรมสื่อสารข้อมูล
1G10400	ฝ่ายสื่อสารข้อมูล
1G20000	สายงาน(อ)-กลุ่มธุรกิจอิเล็กทรอนิกส์
1G20100	ฝ่ายพัฒนาธุรกิจอิเล็กทรอนิกส์
1G20200	ฝ่ายวิศวกรรมธุรกิจอิเล็กทรอนิกส์
1G20300	ฝ่ายธุรกิจความปลอดภัยเทคโนโลยีสารสนเทศ
1H00000	สายงานธุรกิจสื่อสารไร้สาย
1H00100	ฝ่ายพัฒนาธุรกิจสื่อสารไร้สาย
1H00200	ฝ่ายพัฒนาผลิตภัณฑ์สื่อสารไร้สาย
1H10000	กลุ่มปฏิบัติการสื่อสารไร้สาย
1H10100	ฝ่ายวิศวกรรมสื่อสารไร้สาย
1H10200	ฝ่ายปฏิบัติการและบำรุงรักษาสื่อสารไร้สาย
1H10300	ฝ่ายพัฒนาธุรกิจโครงข่ายไร้สาย
1H10400	ฝ่ายขายส่งบริการสื่อสารไร้สาย
1I00000	สายงานธุรกิจการตลาด
1I00100	ฝ่ายบริหารการตลาด
1I00200	ฝ่ายส่งเสริมภาพลักษณ์องค์กร
1I00300	ฝ่ายบริหารความสัมพันธ์ลูกค้า
1I00400	ฝ่ายจัดเก็บและบริหารหนี้ส.กลาง
1I10000	สายงานธุรกิจการตลาด กลุ่มบริการลูกค้า
1I10100	ฝ่ายบริการลูกค้าภาครัฐ
1I10200	ฝ่ายบริการลูกค้าเอกชน
1I10300	ฝ่ายบริการลูกค้าผู้ประกอบการ
1J00000	สายงานการตลาด
1J00100	ฝ่ายประชาสัมพันธ์และสื่อสารองค์กร
1J00200	ฝ่ายบริหารลูกค้า
1J00300	ฝ่ายบริหารคุณภาพบริการ
1J00400	ฝ่ายบริหารประสบการณ์ลูกค้า
1J00500	ศูนย์นวัตกรรม
1J10000	กลุ่มขายและปฏิบัติการฯ ตะวันตก ใต้ ออก
1J10100	ฝ่ายขายและปฏิบัติการลูกค้าเขตใต้
1J10125_GP	สำนักงานบริการลูกค้า กสท ภูเก็ต
1J10127_GP	สำนักงานบริการลูกค้า กสท สุราษฎร์ธานี
1J10130_GP	สำนักงานบริการลูกค้า กสท หาดใหญ่
1J10200	ฝ่ายขายและปฏิบัติการลูกค้าเขตตะวันตก
1J10300	สำนักงานบริการลูกค้า กสท เขตนครหลวง
1J10400	ฝ่ายงานบริการลูกค้า เขตกรุงเทพฯ และปริมณ
1J20000	กลุ่มขายและปฏิบัติการฯ กลาง เหนือและ อน.
1J20100	ฝ่ายงานขายและปฏิบัติการลูกค้าเขตเหนือ
1J20120_GP	สำนักงานบริการลูกค้า กสท เชียงใหม่
1J20123_GP	สำนักงานบริการลูกค้า กสท ลำปาง
1J20129_GP	สำนักงานบริการลูกค้า กสท เชียงราย
1J20138_GP	สำนักงานบริการลูกค้า กสท พิษณุโลก
1J20200	ฝ่ายงานขายและปฏิบัติการลูกค้าเขตกลาง
1J20227_GP	สำนักงานบริการลูกค้า กสท นครสวรรค์
1J30000	กลุ่มสำนักงานบริการ3
1J30100	ฝ่ายงานขายและปฏิบัติการลูกค้าเขต อน.
1J30125_GP	สำนักงานบริการลูกค้า กสท อุบลราชธานี
1J30130_GP	สำนักงานบริการลูกค้า กสท ขอนแก่น
1J30133_GP	สำนักงานบริการลูกค้า กสท อุดรธานี
1J30135_GP	สำนักงานบริการลูกค้า กสท หนองคาย
1J30200	ฝ่ายขายและปฏิบัติการลูกค้าเขตตะวันออก
1J40000	กลุ่มบริการลูกค้าภาครัฐ (ยกเลิก)
1J40100	ฝ่ายบริการหน่วยงานภาครัฐ
1J40200	ฝ่ายพัฒนาธุรกิจการตลาดฯภาครัฐ (ยกเลิก)
1J50000	กลุ่มบริการลูกค้าขายส่งและเอกชน (ยกเลิก)
1J50100	ฝ่ายบริการหน่วยงานเอกชน
1J50200	ฝ่ายบริการหน่วยงานผู้ประกอบการ
1J50300	ฝ่ายขายผู้ประกอบการต่างประเทศ
1J50400	ฝ่ายพัฒนาธุรกิจการตลาดลูกค้าภาคเอกชน
1J60000	กลุ่มขายและผลิตภัณฑ์สื่อสารไร้สาย
1J60100	ฝ่ายผลิตภัณฑ์โทรศัพท์
1J60200	ฝ่ายขายและตลาดสื่อสารไร้สาย
1J60300	ฝ่ายพัฒนาธุรกิจสื่อสารไร้สาย
1J60400	ฝ่ายลูกค้ารายย่อยกรุงเทพฯ และปริมณฑล
1J60409_GP	ส่วนงานบริการลูกค้า 1-ยต.
1J60410_GP	ส่วนงานบริการลูกค้า 2-ยต.
1J60411_GP	ส่วนงานบริการลูกค้า 3-ยต.
1J60412_GP	ส่วนงานบริการลูกค้า 4-ยต.
1J60413_GP	ส่วนงานบริการลูกค้า 5-ยต.
1J60414_GP	ส่วนงานบริการลูกค้า 6-ยต.
1J60415_GP	ส่วนงานบริการลูกค้า 7-ยต.
1J60500	ฝ่ายปฎิบัติการศูนย์ข้อมูล
1J70000	กลุ่มบริการลูกค้า
1J80000	กลุ่มปฏิบัติการ
1K00000	หน่วยงานสายงานกฎหมายและร่วมการงาน
1K00100	ฝ่ายบริหารสัญญาร่วมการงาน
1K00200	ฝ่ายบริหารทรัพย์สินร่วมการงาน
1K00300	ฝ่ายรัฐกิจสัมพันธ์ 1
1K00400	ฝ่ายที่ปรึกษาและสัญญา 1
1K00500	ฝ่ายคดี
1K10000	กลุ่มร่วมการงาน
1K10100	ฝ่ายบริหารสัญญาโครงข่ายไร้สาย
1K10200	ฝ่ายบริหารทรัพย์สินร่วมการงาน
1K20000	กลุ่มกฎหมาย
1L00000	สายงานการเงิน
1L00100	ฝ่ายวางแผนการเงินและงบประมาณ
1L00200	ฝ่ายบริหารการเงิน
1L10000	กลุ่มบัญชีและการเงิน
1L10100	ฝ่ายบัญชีการเงิน
1L10200	ฝ่ายบัญชีบริหาร
1L10300	ฝ่ายบัญชีลูกหนี้เจ้าหนี้
1M00000	สายงานทรัพยากรบุคคล
1M00100	ฝ่ายบริหารทรัพยากรบุคคล 1
1M00200	ฝ่ายพัฒนาทรัพยากรบุคคล
1M00300	ฝ่ายสวัสดิการและบริหารแรงงานสัมพันธ์ 1
1M10000	กลุ่มทรัพยากรบุคคล 1
1N00000	สายงานเทคโนโลยี
1N00100	ฝ่ายกลยุทธ์เทคโนโลยีสารสนเทศ
1N00200	ฝ่ายเทคโนโลยีสารสนเทศเพื่อบริหารองค์กร
1N00300	ฝ่ายเทคโนโลยีสารสนเทศเพื่อสนับสนุนธุรกิจ
1N00400	ฝ่ายเทคโนโลยีศูนย์ข้อมูล
1N10000	กลุ่มเทคโนโลยีสารสนเทศ
1N10100	ฝ่ายกลยุทธ์เทคโนโลยีสารสนเทศ
1N10200	ฝ่ายเทคโนโลยีสารสนเทศเพื่อบริหารองค์กร
1N10300	ฝ่ายเทคโนโลยีสารสนเทศเพื่อสนับสนุนธุรกิจ
1O00000	ด้านกิจการพิเศษ
1P00000	สายงานโครงสร้างพื้นฐาน
1P00100	ฝ่ายวางแผนและวิศวกรรม
1P10000	กลุ่มผลิตภัณฑ์
1P10100	ฝ่ายผลิตภัณฑ์บรอดแบนด์
1P10200	ฝ่ายผลิตภัณฑ์สื่อสารข้อมูล
1P10300	ฝ่ายผลิตภัณฑ์ธุรกิจอิเล็กทรอนิกส์
1P10400	ฝ่ายธุรกิจความปลอดภัยเทคโนโลยีสารสนเทศ
1P10500	ฝ่ายผลิตภัณฑ์สื่อสารดาวเทียม
1P20000	กลุ่มปฏิบัติการบริการ
1P20100	ฝ่ายปฏิบัติการโทรศัพท์
1P20200	ฝ่ายปฏิบัติการสื่อสารข้อมูล
1R00000	สายงานขายและปฏิบัติการลูกค้า 1
1T00000	สายงานควบรวมภูมิภาค
1T00100	ฝ่ายควบรวมภูมิภาค
1U00000	สายงานบริหารการเปลี่ยนแปลง
1U00100	ฝ่ายบริหารการเปลี่ยนแปลง
2A10000	กลุ่มตรวจสอบ
2A10100	ฝ่ายตรวจสอบกระบวนการหลัก
2A10200	ฝ่ายตรวจสอบกระบวนการสนับสนุน
2A10300	ฝ่ายตรวจสอบเทคโนโลยี
2B10000	กลุ่มบริหารงานเลขานุการบริษัท
2B10100	ฝ่ายเลขานุการคณะกรรมการบริษัท
2B10200	ฝ่ายเลขานุการผู้บริหาร 2
2C20000	กลุ่มพัสดุและสินทรัพย
2C20100	ฝ่ายการพัสดุ 2
2C20200	ฝ่ายบริหารสินทรัพย์ 2
2C20300	ฝ่ายบริการทั่วไป
2C30000	กลุ่มที่ปรึกษาและสัญญา
2C30100	ฝ่ายที่ปรึกษา 2
2C30200	ฝ่ายสัญญา 2
2C30300	ฝ่ายสัญญาร่วมการงาน
2C40000	กลุ่มคดีและข้อพิพาท
2C40100	ฝ่ายกฎหมายนครหลวง
2C40200	ฝ่ายกฎหมายภูมิภาค
2C40300	ฝ่ายคดีข้อพิพาทโทรคมนาคม
2C40400	ฝ่ายคดีข้อพิพาททั่วไป
2C40500	ฝ่ายคดีข้อพิพาทล้มละลายและบังคับคดี
2F00000	สายงานพัฒนาผลิตภัณฑ์และเทคโนโลยี
2F10000	กลุ่มผลิตภัณฑ์และเทคโนโลยี
2F10100	ฝ่ายพัฒนาผลิตภัณฑ์
2F10200	ฝ่ายระบบบริการลูกค้า
2F10300	ฝ่ายเทคโนโลยีสารสนเทศ
2F10400	ฝ่ายใบแจ้งหนี้
2F20000	กลุ่มธุรกิจผลิตภัณฑ์คลาวด์และดิจิทัล
2F20100	ฝ่ายกลยุทธ์และบริหารธุรกิจ
2F20200	ฝ่ายพัฒนาผลิตภัณฑ์คลาวด์และดิจิทัล
2F20300	ฝ่ายธุรกิจลูกค้าสัมพันธ์
2F20400	ฝ่ายพัฒนาดิจิทัลเทคโนโลยี
2F20500	ฝ่ายบริหารสื่อดิจิทัลและข้อมูลลูกค้า
2F20600	ฝ่ายเทคนิคบริการลูกค้าองค์กร
2F20700	ฝ่ายบริหารงานลูกค้าองค์กร
2G10000	กลุ่มขายและบริการลูกค้าองค์กร 2
2G10100	ฝ่ายขายราชการ 2
2G10200	ฝ่ายขายรัฐวิสาหกิจและองค์กรภาครัฐ 2
2G10300	ฝ่ายขายเอกชน 2
2G10400	ฝ่ายเทคนิคบริการลูกค้าองค์กร
2G10500	ฝ่ายบริหารงานลูกค้าองค์กร
2I00000	สายงานสื่อสารไร้สาย 2
2I00100	ฝ่ายธุรกิจสื่อสารไร้สาย
2I10000	กลุ่มพัฒนาและปฏิบัติการสื่อสารไร้สาย
2I10100	ฝ่ายโทรศัพท์เคลื่อนที่
2I10200	ฝ่ายโทรศัพท์เคลื่อนที่ยุคที่ 5
2K10000	กลุ่มกลยุทธ์องค์กร 2
2K10100	ฝ่ายวางแผนกลยุทธ์องค์กร 2
2K10200	ฝ่ายพัฒนาองค์กรและประเมินผล 2
2K10300	ฝ่ายรัฐกิจสัมพันธ์ 2
2K10400	ฝ่ายบริหารความเสี่ยง 2
2L10000	กลุ่มบัญชีการเงิน
2L10100	ฝ่ายต้นทุน
2L10200	ฝ่ายบัญชี
2L10300	ฝ่ายการเงิน
2L20000	กลุ่มการคลัง
2L20100	ฝ่ายการคลัง
2L20200	ฝ่ายจัดเก็บรายได้และบริหารหนี้
2M10000	กลุ่มทรัพยากรบุคคล 2
2M10100	ฝ่ายบริหารทรัพยากรบุคคล 2
2M10200	ฝ่ายกิจการสัมพันธ์ 2
2M10300	สถาบันวิชาการ
2O00000	สายงานขายและปฏิบัติการลูกค้า 2
2O10000	กลุ่มขายและปฏิบัติการลูกค้านครหลวง 1
2O10100	ฝ่ายขายและปฏิบัติการลูกค้านครหลวงที่ 1.1
2O10200	ฝ่ายขายและปฏิบัติการลูกค้านครหลวงที่ 1.2
2O20000	กลุ่มขายและปฏิบัติการลูกค้านครหลวง 2
2O20100	ฝ่ายขายและปฏิบัติการลูกค้านครหลวงที่ 2.1
2O20200	ฝ่ายขายและปฏิบัติการลูกค้านครหลวงที่ 2.2
2O20300	ฝ่ายขายและปฏิบัติการลูกค้านครหลวงที่ 2.3
2O30000	กลุ่มขายและปฏิบัติการลูกค้านครหลวง 3
2O30100	ฝ่ายขายและปฏิบัติการลูกค้านครหลวงที่ 3.1
2O30200	ฝ่ายขายและปฏิบัติการลูกค้านครหลวงที่ 3.2
2O30300	ฝ่ายขายและปฏิบัติการลูกค้านครหลวงที่ 3.3
2P10000	กลุ่มโครงสร้างพื้นฐานโทรคมนาคม
2P10100	ฝ่ายธุรกิจท่อร้อยสาย
2P10200	ฝ่ายธุรกิจเสาโทรคมนาคม
2P10300	ฝ่ายขายและบริการโครงสร้างพื้นฐาน
2P20000	กลุ่มบริหารโครงข่าย
2P20100	ฝ่ายบริหารโครงข่าย
2P20200	ฝ่ายสื่อสัญญาณ 2
2P20300	ฝ่ายบริหารโครงสร้างพื้นฐานและบริการพิเศษ
2P20400	ฝ่ายวิจัยและพัฒนา
2Q00000	สายงานขายและปฏิบัติการลูกค้า 3
2Q10000	กลุ่มขาย&ปฏิบัติฯ เหนือล่าง และ อน.ล่าง
2Q10100	ฝ่ายขาย&ปฏิบัติ เหนือล่าง อน.ล่าง ที่ 1
2Q10200	ฝ่ายขาย&ปฏิบัติ เหนือล่าง อน.ล่าง ที่ 2
2Q20000	กลุ่มขายและปฏิบัติฯ ตะวันออกเฉียงเหนือ
2Q20100	ฝ่ายขายและปฏิบัติฯ ตะวันออกเฉียงเหนือ 1
2Q20200	ฝ่ายขายและปฏิบัติฯ ตะวันออกเฉียงเหนือ 2
2Q30000	กลุ่มขายและปฏิบัติการลูกค้า ภาคเหนือ
2Q30100	ฝ่ายขายและปฏิบัติการลูกค้า ภาคเหนือที่ 1
2Q30200	ฝ่ายขายและปฏิบัติการลูกค้า ภาคเหนือที่ 2
2R00000	สายงานขายและปฏิบัติการลูกค้า 4
2R10000	กลุ่มขายและปฏิบัติการลูกค้า ภาคกลาง
2R10100	ฝ่ายขายและปฏิบัติการลูกค้า ภาคกลางที่ 1
2R10200	ฝ่ายขายและปฏิบัติการลูกค้า ภาคกลางที่ 2
2R20000	กลุ่มขายและปฏิบัติการลูกค้า ภาคใต้
2R20100	ฝ่ายขายและปฏิบัติการลูกค้า ภาคใต้ที่ 1
2R20200	ฝ่ายขายและปฏิบัติการลูกค้า ภาคใต้ที่ 2
2R30000	กลุ่มขายและปฏิบัติการลูกค้า ภาคตะวันออก
2R30100	ฝ่ายขายและปฏิบัติการลูกค้า ตะวันออกที 1
2R30200	ฝ่ายขายและปฏิบัติการลูกค้า ตะวันออกที 2
2S10000	กลุ่มการตลาดและสื่อสารองค์กร
2S10100	ฝ่ายกลยุทธ์การตลาด
2S10200	ฝ่ายประชาสัมพันธ์และสื่อสารองค์กร 2
2S10300	ฝ่ายสื่อสารการตลาด
2V00000	สายงานควบรวมนครหลวง
2V00100	ฝ่ายควบรวมนครหลวง
